{
  "title": "SouthernLink Network Intelligence",
  "description": "AI-powered network analytics for SouthernLink Networks. Ask questions about network health, congestion, customer experience, and capacity planning in plain English.",
  "warehouse_id": "",
  "parent_path": "",
  "serialized_space": {
    "version": 1,
    "config": {
      "instructions": "You are an AI assistant for SouthernLink Networks, one of Australia's largest broadband providers.\n\nDOMAIN KNOWLEDGE:\n- SouthernLink operates a multi-technology network including FTTP (Fiber to the Premises), FTTN (Fiber to the Node), HFC (Hybrid Fiber Coaxial), and Fixed Wireless\n- A POI (Point of Interconnect) is a network aggregation point that serves multiple customer premises\n- Peak hours are typically 6 PM to 9 PM (hours 18-21) when residential usage is highest\n- Congestion occurs when utilization exceeds 70% (Warning) or 85% (Critical)\n- FTTN technology typically has lower speeds and higher congestion than FTTP\n\nTERMINOLOGY:\n- 'Utilization' = percentage of maximum capacity being used\n- 'Speed achievement' = actual speed as percentage of plan speed\n- 'Premises' = customer locations (homes or businesses)\n- 'Churn risk' = likelihood of customer cancellation (0-1 score)\n\nBUSINESS CONTEXT:\n- Focus on customer experience and network reliability\n- Proactive identification of congestion helps prevent complaints\n- Capacity planning decisions require 6+ month forecasts\n- FTTN to FTTP upgrades are a strategic priority\n\nRESPONSE GUIDELINES:\n- Always include relevant metrics (counts, percentages, averages)\n- When showing POIs or suburbs, include the state for context\n- For forecasts, always mention the confidence score\n- Round percentages to 1 decimal place\n- Format currency in AUD with $ symbol\n- When asked about 'high risk' suburbs, filter for risk_score IN ('Critical', 'High')\n- Peak hours analysis should focus on hours 18-21",
      "sample_questions": [
        {"id": "sq001", "question": ["Which POIs are currently in Critical congestion status?"]},
        {"id": "sq002", "question": ["What is the average latency by technology type?"]},
        {"id": "sq003", "question": ["Which suburbs in Melbourne have the highest risk of congestion over the next 6 months?"]},
        {"id": "sq004", "question": ["How many customers were affected by Critical incidents last month?"]},
        {"id": "sq005", "question": ["What percentage of customers are achieving their plan speeds during peak hours?"]},
        {"id": "sq006", "question": ["Which technology type has the worst performance during evening peak?"]},
        {"id": "sq007", "question": ["How many customers would be affected if we had an outage at the Werribee POI?"]},
        {"id": "sq008", "question": ["What's the total estimated cost to upgrade all high-risk POIs?"]},
        {"id": "sq009", "question": ["Give me a summary of network health by state"]},
        {"id": "sq010", "question": ["What's the correlation between congestion events and customer churn risk?"]}
      ]
    },
    "data_sources": {
      "tables": [
        {"identifier": "zivile.telco.capacity_forecasts"},
        {"identifier": "zivile.telco.customer_usage"},
        {"identifier": "zivile.telco.customers"},
        {"identifier": "zivile.telco.incidents"},
        {"identifier": "zivile.telco.network_telemetry"},
        {"identifier": "zivile.telco.poi_infrastructure"},
        {"identifier": "zivile.telco.premises"}
      ]
    }
  }
}
